{
  "Movies": [
    {
      "id": 1,
      "title": "When Hagrid met Sally",
      "year": 2005,
      "rating": 4,
      "imageUrl": "https://wallpaperaccess.com/full/314204.jpg",
      "review": "An unforgettable cinematic masterpiece that will leave you speechless.",
      "description": "During his time in New York, Big Dawg Hagrid fell in love with the lovely young Sally, who would always make a loud “orgasmic scene” in public lunchrooms."
    },
    {
      "id": 2,
      "title": "The wolf of Hogwarts",
      "year": 2010,
      "rating": 3,
      "imageUrl": "https://wallpaperaccess.com/full/314123.jpg",
      "review": "A breathtaking journey that pushes the boundaries of storytelling in film.",
      "description": "When Harry was struggling to make ends meet, he met this guy who showed him the ropes, they rolled out a Ponzi-scheme while doing a lot of drugs together. Based on a true story!"
    },
    {
      "id": 3,
      "title": "Jurrasic Potter",
      "year": 2018,
      "rating": 5,
      "imageUrl": "https://wallpaperaccess.com/full/515937.png",
      "review": "Incredible performances and stunning visuals make this a must-see movie event.",
      "description": "Harry Potter has always been really passionate about three things: Magic, his secret love for Hermione and…. Creating extinct Dinosaurs by cloning them using ancient DNA! In hindsight; maybe not one of his best ideas."
    },
    {
      "id": 4,
      "title": "The Half-Blood Prince of Bel-Air",
      "year": 2003,
      "rating": 2,
      "imageUrl": "https://wallpaperaccess.com/full/940123.jpg",
      "review": "A tour de force of suspense and emotion. A cinematic triumph.",
      "description": "Being kicked out of Hogwarts “after one little fight” Dumbledore got scared and moved Harry to his far uncle and auntie in Bel Air."
    },
    {
      "id": 5,
      "title": "Fantastic Beasts and Where to Find Dory",
      "year": 2016,
      "rating": 1,
      "imageUrl": "https://wallpaperaccess.com/full/940130.jpg",
      "review": "An epic spectacle that will transport you to another world. Movie magic at its finest.",
      "description": "Harry is living amongst muggles, when he meets this amazing fish called Dory, quite the character I would say! He tries to help her find her parents, but her memory-loss is not helping at all!"
    },
    {
      "id": 6,
      "title": "A Muggle's Guide to the Galaxy",
      "year": 2015,
      "rating": 4,
      "imageUrl": "https://wallpaperaccess.com/full/314142.jpg",
      "review": "A brilliantly directed film that keeps you on the edge of your seat from start to finish.",
      "description": "After years of addiction and a lot of gambling, Harry decides to play in a Jazz-group. But his magic will only help him this much. Will he be able to make it back to Hogwarts?"
    },
    {
      "id": 7,
      "title": "Ginny Weasley: The Chamber of Love",
      "year": 2008,
      "rating": 3,
      "imageUrl": "https://wallpaperaccess.com/full/314143.jpg",
      "review": "A thought-provoking and emotionally resonant story that lingers long after the credits roll.",
      "description": "After being sick and tired of playing quidditch, Ginny found another way to entertain herself, will her secret love-potion make Dumbledore fall in love with Voldemort?"
    },
    {
      "id": 8,
      "title": "Harry Potter and the midlife crisis of magic",
      "year": 2022,
      "rating": 5,
      "imageUrl": "https://wallpaperaccess.com/full/314216.jpg",
      "review": "A gripping and intense cinematic experience that will leave you craving more.",
      "description": "It seems Harry’s spells are not working anymore! He tries to switch to more regular jobs, and then comes to discover he wants to start in the “dog walking business” with a group of illegal immigrants. Seems like he bit his own tail this time around!"
    },
    {
      "id": 9,
      "title": "Harry Potter and the mischief of Hogwarts",
      "year": 2014,
      "rating": 2,
      "imageUrl": "https://wallpaperaccess.com/full/22917.jpg",
      "review": "An instant classic that will be cherished by film enthusiasts for generations.",
      "description": "Harry and the Weasleys started a boyband in Hogwarts, only to impress Hermione and her girlfriends, but then Dumbledore finds out more and more girls are getting pregnant and Dumbledore is not having any of that!"
    },
    {
      "id": 10,
      "title": "Dumbledore's Magic Cooking Show",
      "year": 2004,
      "rating": 4,
      "imageUrl": "https://wallpaperaccess.com/full/276565.jpg",
      "review": "A visual feast for the eyes and a heartfelt journey for the soul. Truly extraordinary.",
      "description": "Dumbledore never made a secret out of his love for master chefs like Gordon Ramsey and Marco Pierre White, and this time around he wanted to start his own cooking-show live from Hogwards! But can he walk the walk and talk the talk?"
    },
    {
      "id": 11,
      "title": "Harry Potter and the trial of Amber Heard",
      "year": 2019,
      "rating": 3,
      "imageUrl": "https://wallpaperaccess.com/full/940124.jpg",
      "review": "A riveting and powerful film that leaves an indelible mark on your heart.",
      "description": "After a short romance Harry got carried away, and asked Amber to marry him. After the wedding, things went south pretty soon! Harry tends to get violent after a couple of MEGAPINTS, and Amber developed a nasty habit, of leaving her feces behind in the bed. A trail came, but who will prevail?"
    },
    {
      "id": 12,
      "title": "Harry Potter Snoop Dogg and Joe Biden, friends for life!",
      "year": 2007,
      "rating": 1,
      "imageUrl": "https://wallpaperaccess.com/full/314129.jpg",
      "review": "A rare gem in modern cinema. Prepare to be moved, inspired, and awed.",
      "description": "In this real-life soap Harry meets up with his best mates Snoop Dogg and Joe Biden, they hang around in the Whitehouse, play ball in Long Beach, and Hagrid pulls a prank on them at Hogwards. You see the three friends become closer and closer, but is their friendship strong enough to overcome all their cultural backgrounds and indifferences? They reach out to Mathieu Saubin, Joshua George and Eric Coimbra, to help them find some life-hacks, in maintaining personal relationships."
    }
  ]
}